Repository: akx/shoop-checkoutfi
Catalog: shuup_checkoutfi/locale/*/LC_MESSAGES/django.po
Languages: fi, sv

source: Checkout.fi Payments Addon
fi: Checkout.fi-maksulisäosa
sv: Checkout.fi-betalningstillägg

source: Merchant ID
fi: Myyjän tunniste
sv: Försäljarens ID

source: Merchant Secret
fi: Myyjän turva-avain
sv: Försäljarens hemlighet

source: Checkout.fi payment processor
fi: Checkout.fi-maksukäsittelijä
sv: Checkout.fi-betalningshanterare

source: Missing values
fi: Arvoja puuttuu
sv: Värden fattas

source: Payment canceled. Try again.
fi: Peruit maksamisen. Yritä uudestaan.
sv: Betalning annulerad. Gör ett nytt försök.

source: Checkout.fi {payment_id} (ref {order_reference})
fi: Checkout.fi {payment_id} (viite {order_reference})
sv: Checkout.fi {payment_id} (referens {order_reference})

source: Payment validation failed.
fi: Maksun validointi epäonnistui.
sv: Validering av betalning misslyckades.

source: Unknown return code %s
fi: Tuntematon paluuarvo %s
sv: Okännt returvärde %s

source: Continue to Checkout.fi
fi: Siirry maksamaan Checkoutissa
sv: Fortsätt till Checkout.fi

source: Accept credit cards using <a target='_blank' href='%(url)s'>Checkout.fi</a>. Checkout.fi is one of the largest Finnish payment service providers and supports bank payments, Visa, and Mastercard.
fi: Hyväksy verkkomaksut <a target='_blank' href='%(url)s'>Checkout.fi</a>. Checkout.fi on Suomen johtava kotimainen maksuvälittäjä ja sisältää pankkien maksupainikkeet sekä Visa- ja Mastercard-kortit.
sv: Godkänn kreditkort <a target='_blank' href='%(url)s'>Checkout.fi</a>. Checkout.fi är Finlands ledande inhemska betalningsförmedlare och stöderbetalning via bank, Visa, och Mastercard.

source: Don't have an account?
fi: Ei tiliä?
sv: Inget konto?

source: Register now
fi: Rekisteröidy nyt
sv: Registrera nu
